using System;

internal sealed class 咵싛卒釉仆鮲롚엯糔鰞룹铬钎 : Attribute
{
	private static void 揅仔죝竻寑꼭軏됵诏艍慞悚廌髉쭤盎()
	{
		int num = -1513841084 ^ 0x3BF3E7FD;
		num = (num ^ (0x40C1FCF6 ^ (((-1880191916 ^ -1) + -546) ^ (2861 + -(0x5BEF976A ^ 0x5BEF966A))) ^ (0x50BB3D75 ^ ((0x6E00BE4F ^ 0x6E00B670) + -403)))) << ((~523693125 + 1 + -1) ^ 0x1FF8 ^ -1 ^ 0x1F36F3B5);
		num = (num ^ ((-1780413413 + -245) ^ 0x2519 ^ -1 ^ 0x17E0B4FF)) << (0x2689A950 ^ (2736 + -674) ^ (0x2689A786 ^ (2284 + -530)));
		num = (num ^ (0x1B309B10 ^ (((678464630 + -14698) & -1) ^ (2386 + -270)))) << (0x69FFF3AB ^ ((27056963 + -(0x4B73 ^ 0x4AFE)) ^ 0xB44) ^ ((1751356754 + -23444 + -3821) ^ (~-2971 + 1 + -1)));
	}

	private static bool 딈劷鹩螚嫒狋롮섂筦쥮쾎緹顃()
	{
		int num = 0x5A17DB97 ^ (((1511536444 + -27433) & -1) ^ (~-6061 + 1 + -1 + -14));
		do
		{
			num -= -(0x1172D586 ^ (0x1172F36C ^ (~-9964 + 1 + -1)));
		}
		while (num < (0x31675D0C ^ (~-5702 + 1 + -1) ^ ((1892590755 + -(~-218 + 1 + -1)) ^ 0xE69) ^ 0x41A9E428));
		return (byte)(-1155272487 ^ (25669 + -358 + -20238) ^ -1 ^ ((1155274047 + -((2037 + -1483) & -1)) ^ (4890 + -(-825 ^ -1)))) != 0;
	}

	private static void 뷥鮉缢篂輥搣丆脣袭쫫砣矓鱾絛에觖幘()
	{
		int num = 31;
		do
		{
			num += 3;
		}
		while (num < 649);
	}

	private static void 勷應僡輦췈榯嗣뎭嵟醝렏뵢雥眃쬰굂笝邋띎毸()
	{
		bool flag = true;
		if ((0x113C2F63 & 0x25C60749) == 0)
		{
			flag = false;
		}
		_ = 0;
	}
}
