using System;

internal sealed class 堦뇍詃騺瞔屖솓罅適쭶爛裝캓촨 : Attribute
{
	private static bool 뇗昅疞틉삨姕洋咠쒘鰴쌯퇳馝撝墊藪侇篠玙拈()
	{
		int num = 0x4ECB6F61 ^ (0x1D11922D ^ (7099 + -(~-850 + 1 + -1))) ^ 0x53DAE531;
		do
		{
			num -= -(((0x55A9E927 ^ 0x6F1) + -(0xD9AA ^ 0x251E)) ^ 0x55A8F323);
		}
		while (num < (0x1017645D ^ 0x101764E0));
		return (byte)((453932921 + -33) ^ 0xA67 ^ 0xA0C6F41 ^ ((285345385 + -666) ^ 0x11B1)) != 0;
	}

	private static int 隉妒誗漱邺暓뤀誾틏鎉웴砳謬쵌뻫냁蚵()
	{
		int num = 0x131DE37D ^ (32980 + -14471 + -16751) ^ ((~-571682967 + 1 + -1) ^ (((8614 + -2927) & -1) + -(-782 ^ -1))) ^ ((823053898 + -991) ^ 0xC7E);
		do
		{
			num -= -(((((0x575BA0D5 ^ 0x6D59) + -437) ^ 0x1705) + -(0xE44F ^ 0xBF2)) ^ (0x575AE0BA ^ (3630 + -(0x7B68ADB1 ^ 0x7B68AD33))));
		}
		while (num < (0x4B180E5C ^ ((32572 + -29867) & -1) ^ 0x680FD7F4 ^ 0x2317D0A8));
		return 0x10E30C3E ^ ((1850821196 + -(52422 + -32277 + -20011)) ^ 0x1400) ^ (((0x26A4FEC9 ^ 0x58169C42) + -886) ^ 0xEED);
	}

	private static void 肤슾鷴鵏햩谈戇梽枙蓐虒澄姭鯀띑母尔奣()
	{
		int num = -604658854 ^ (((0x1113A1F ^ 0x44D23909) + -881) ^ 0x2546);
		num = (num ^ (((0x131CAD2D ^ (53664 + -31418 + -11491 + -(0x5CD981B ^ 0x5CD9B07))) + -(0xFF82 ^ 0x1066)) ^ (0x2E2CE7A6 ^ (5015 + -37)))) << (-451153846 ^ (17418 + -5724 + -2095) ^ -1 ^ 0x1AE42ACD);
		num = (num ^ ((1333548164 + -16581 + -10747) ^ 0xB28 ^ 0x39DCA4DB)) << ((~-1321577465 + 1 + -1) ^ 0xC70 ^ ((1204757747 + -19082 + -26065 + -(-654 ^ -1)) ^ 0x7CF) ^ (0x90BF6E3 ^ ((0xAA60497 ^ 0xAA6234E) + -811)));
		num = (num ^ (((0x1C3DC986 ^ 0x131D) + -(0x4972 ^ 0x14CE)) ^ ((1042203847 + -154) ^ 0x2525))) << ((1434283434 + -(0x33666286 ^ 0x336660DA)) ^ (6900 + -(0x450846D8 ^ 0x4508441E)) ^ (0x557D68E2 ^ (7728 + -(~-669 + 1 + -1))));
	}

	private static bool 낈炵쫥讯镛쥬喜폞骇孡滴煂룷鑌鑱쪙瞭娞()
	{
		int num = 14;
		do
		{
			num += 3;
		}
		while (num < 330);
		return false;
	}

	private static int 宍혲娛瓭횝瓶兝뀻蚍毺领汐븨뉹얺맻輤赢矖喉()
	{
		bool flag = true;
		if ((0x36320893 & 0x3FD361FE) == 0)
		{
			flag = false;
		}
		_ = 0;
		return 0;
	}

	private static void 쳾迎鋺婌큉恾넩닜郵듵聪废拚핹쐜霴퍫()
	{
		bool flag = true;
		if ((0x20F1DC2 & 0x6BA72926) == 0)
		{
			flag = false;
		}
		_ = 0;
	}
}
