using System;

internal sealed class 掩郮昡骈듔仱욵衯陬쫡븞刾緾흺内昞昳蜫銛 : Attribute
{
	private static bool 卅慨矘픃촻躩攌媡鰔뒣()
	{
		bool flag = (byte)(0x620BEE01 ^ (((0x620BB217 ^ 0x4BBF) + -894) ^ (6554 + -(~-369 + 1 + -1)))) != 0;
		if ((((1943127127 + -(0x5EF45320 ^ 0x5EF45295)) ^ (~-3962 + 1 + -1) ^ (0x13A1A9F7 ^ ((9972 + -2519) & -1))) & (((0x402405D9 ^ 0x499) + -((((67673 + -10531) & -1) + -140) ^ 0x1769)) ^ 0x6BC11B75)) == (((0x733A2FB4 ^ 0x1FAC) + -(0xDA11 ^ 0x2474)) ^ ((1933126764 + -73) ^ 0x1D90)))
		{
			flag = (byte)(0x4749EE51 ^ (8427 + -(0x1B49 ^ 0x181F)) ^ ((1254094048 + -6071 + -20644 + -813) ^ 0x1CAC) ^ 0xDF66630) != 0;
		}
		_ = 0x3BDCB727 ^ 0x3BDCB727;
		return (byte)((77532234 + -17223 + -22712) ^ (2369 + -(0x23BCEF41 ^ 0x23BCEFCE)) ^ 0x49E78F9) != 0;
	}

	private static int 掎鍜餚愞逕鉕猼뻇()
	{
		int num = 0x502DBF83 ^ ((1345167868 + -838) ^ 0x2127);
		do
		{
			num -= -(((1116218291 + -24955) & -1) ^ 0x12BF ^ (0x49DCFBE1 ^ ((0x9FC ^ 0x1FAF) + -(0x19418284 ^ 0x1941838C))) ^ 0xB5B3E28);
		}
		while (num < (((0x57256923 ^ (5747 + -228)) + -(0xA5B ^ 0x72D)) ^ ((1462073268 + -(~-721 + 1 + -1)) ^ (6497 + -((13753 + -13726) & -1)))));
		return -671284999 ^ (3886 + -608) ^ -1 ^ (0x2802F51E ^ (2378 + -628));
	}

	private static int 欻袠閌뷬챢讨瞽肓娊푠밷綸冉룊()
	{
		bool flag = (byte)(((((0x751EBE82 ^ 0x6C22022C) + -676) ^ 0x241B) + -(0xB0F8 ^ 0x22FA)) ^ ((423375032 + -486) ^ (~-9171 + 1 + -1 + -(~-247 + 1 + -1)))) != 0;
		if (((0x216CDE0 ^ (((311608688 + -19373) & -1) ^ 0x1DBD)) & 0x6A9629A1) == (((0x6B116D74 ^ 0x24CF) + -((43647 + -(0x4C5C ^ 0x4DEC)) ^ 0x462)) ^ ((~-1796246332 + 1 + -1) ^ 0x1635)))
		{
			flag = false;
		}
		_ = 0x43BE85C5 ^ (0x4B980EE ^ (3285 + -262)) ^ (((1191658826 + -5689) & -1) ^ 0x21F5);
		return ((0x458A3FA8 ^ 0x23A4) + -(0x47FE ^ 0x1032)) ^ 0x4589C440;
	}

	private static bool 伱昇棂넛曲솉뤄쏾얗쥃魗詛번썍質齂쪛갲互()
	{
		int num = 10;
		do
		{
			num += 5;
		}
		while (num < 416);
		return false;
	}
}
