internal static class 朦쵊瀒튭藬瑲눊冬癸佭꾓哏缰騥猬효晾
{
	private static int 蛜묑윀줁艼居뒍煬()
	{
		int num = (221895257 + -5239 + -30747 + -505) ^ 0x1A48 ^ -1 ^ 0x6CF1D7C0;
		num = (num ^ (0x6F5EA181 ^ (3438 + -949) ^ ((1138292751 + -((26385 + -25411) & -1)) ^ 0xA3A) ^ (0x4820B1F7 ^ (((37658 + -31769) & -1) + -765)))) << (((0x108F7079 ^ 0x22DF) + -(0xF8F4 ^ (6031 + -709))) ^ ((277767375 + -(~-312 + 1 + -1)) ^ 0x5F7));
		num = (num ^ (0x3E21509C ^ (7727 + -457) ^ ((656649778 + -1358 + -12336) ^ 0x5E4) ^ 0x1C63D006)) << (((0x352777ED ^ 0x2C52) + -45) ^ 0x153D ^ ((~-891767211 + 1 + -1) ^ 0x716));
		num = (num ^ (0x54B27C1B ^ ((1351845036 + -((9394 + -8399) & -1)) ^ 0x1B9D))) << (-523922946 ^ ((18457 + -15761) & -1) ^ -1 ^ 0x1F3A6485);
		num = (num ^ (0x2845DD86 ^ (27334 + -9338 + -15715) ^ ((1606316548 + -(~-554 + 1 + -1)) ^ 0x176B))) << (0x38DAE7E2 ^ (1503 + -161) ^ 0x38DAE2DB);
		return ((0x6805596 ^ ((28409 + -21408) & -1)) + -(0x4B86 ^ (5879 + -873))) ^ 0x67FF6C7;
	}

	private static int 샻될薀桏팾蛍쾤堳垠()
	{
		int num = 5;
		do
		{
			num++;
		}
		while (num < 392);
		return 0;
	}

	private static int 엦抨씟텇厜棒荎绩寍褱숬풁韤窗蝾()
	{
		int num = -1640531527;
		num = (num ^ 0x647CAA5D) << 31;
		num = (num ^ 0x380D536A) << 15;
		num = (num ^ 0xF5D7A6B) << 4;
		return 0;
	}
}
