internal abstract class 焤쑨碋汶륄冠韽櫁풸뷣栀壓링憑啫黬伒
{
	internal string 爐舄儱輂狅善账즱븄푸퀤닭兼駕慝帞焆;

	internal string 敮榡륯騉瞻澁셢履蒂笣藎耹춆撗訊頰悔;

	private int 꾋臶阫鱤줱뿸앨님摠璏볾術걛岟悯萝婳콆()
	{
		int num = ((0x5D98B7BA ^ 0x51D) + -(0xAC7A ^ 0x17C8)) ^ 0x312FAD9B;
		int a = ((韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.뵚匟菽볠볦닒펃簥쌥蕾(), 빈죆痈讕悽欑慱楂좲.垾相潖漪夿뼚걔躏髸冇龟蒞쇛쎗疒欴蜷鈜暼嵷()), ((1575729443 + -30209) & -1) ^ 0x1B6A ^ 0x5DEB7B8D) ^ (빈죆痈讕悽欑慱楂좲.펡셃檁뀐萲酎띖귵荕妿侬() ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(0x327A912A ^ (0x327AB9DA ^ (10164 + -712)) ^ 빈죆痈讕悽欑慱楂좲.戋뭜紎숅殯췖걑慡흯砕折庁駻駆탬蠚衤贓솭(), 韘줎麛퍜锉薑蔴啱潕꺐뷹.菴檝閦淚柠碙庑呄鳳땚椖睨셓뮥셋僧鲚辜粙((0x2D07B380 ^ ((~-755486780 + 1 + -1) ^ ((0x381E ^ 0x2DEB) + -345))) - -(~(0x1928F431 ^ (0x19288C0A ^ (18797 + -3898 + -12015))) + 1), ((-695106397 + -23365) & -1) ^ 0x6D0 ^ ((695174780 + -32204 + -16372) ^ ((-7125 ^ -1) + -775)))))) - -(~(빈죆痈讕悽欑慱楂좲.瓷괈寁赘凅难겱溒첢쑧撔콫鳣迓곀唬() ^ (-292626274 ^ ((292625301 + -175) ^ (27890 + -687 + -25788))) ^ (빈죆痈讕悽欑慱楂좲.胓桹鯩鈏펺滙鱒齲声囜숐順瀂晘췦澶緶頾貦겋() - -(~빈죆痈讕悽欑慱楂좲.봰겕渖纅汢忸恲櫐贘團탓좰辖咁熊暊堒磡绵() + 1)) ^ ((韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(빈죆痈讕悽欑慱楂좲.얊큹賓쉅기鵧黖湑겦毞켸惡聅喾(), -439776140 ^ (40359 + -11878 + -24339) ^ -1 ^ 0x1A367F74) & (((-1121646508 ^ (9183 + -523)) + -((27814 + -13) ^ (~-6207 + 1 + -1))) ^ (((1121694396 + -18246) & -1) ^ (8920 + -648)))) ^ (((0x5A2B055E ^ -1) + -94) ^ 0x79D ^ -1 ^ 0x5A2B13DB))) + 1)) ^ (((-768145139 ^ (28498 + -2664 + -24807) ^ 0x125657C1 ^ (0xE798B82 ^ ((39974 + -31035) & -1)) ^ -1) - -(0x3EBDC5CC ^ ((20725 + -11000) & -1) ^ 0x400FA1EB ^ (0x7EB254FC ^ ((0x7A4D ^ 0x6C86) + -420))) - -(~(0x4C8471D9 ^ ((1283747281 + -(~-111 + 1 + -1)) ^ (8212 + -857))) + 1)) ^ 빈죆痈讕悽欑慱楂좲.鎈竄恺둈寒裐膒青흧죠댤렏廇鴢嘝狔() ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.媡扩仁쑛悉荴됣驵貜진闎(), (((215273389 + -(~-479 + 1 + -1)) ^ 0x1503) + -(0xC813 ^ 0x970)) ^ 0xCD41E83));
		num = 0x63059001 ^ (8761 + -646) ^ (0x19614E05 ^ ((-3067 ^ -1) + -(0x266D0881 ^ 0x266D0857))) ^ (0x3A826141 ^ (42067 + -7085 + -31440 + -633));
		int num2 = 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(a, 0x5242C573 ^ (4426 + -(0x71BC ^ 0x734C)) ^ 0x1D813752 ^ ((254105894 + -347) ^ 0xB3F));
		int num3 = 韘줎麛퍜锉薑蔴啱潕꺐뷹.蔜唴뢽銮珶鑺쩆禃퉿(num2 ^ num, 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(((((1834311520 + -2373) & -1) + -(38441 + -11805 + -26231)) ^ 0x2424 ^ ((133452388 + -(17010 + -2379 + -13676)) ^ (7688 + -(0x3CA9A576 ^ 0x3CA9A485))) ^ 0x1494D54B) - -(~(((0x6822C541 ^ 0x776) + -(((0x106075B6 ^ 0x106028A1) + -588) ^ 0x1CD7)) ^ ((1747082635 + -52) ^ 0x215A)) + 1), 0x2ADECC3 ^ ((567997390 + -3886 + -18733) ^ 0x1CA0) ^ ((595056592 + -3141 + -25089) ^ 0xBA3)) ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(0x40DA887E ^ (4583 + -29) ^ 0x79880ACE, (((0x3C6A4FE9 ^ 0x1EBF) + -(0x5BF0 ^ (5965 + -140))) ^ (0x3C6A1BD1 ^ (5528 + -(~-913 + 1 + -1)))) - -(~빈죆痈讕悽欑慱楂좲.径볣褲蛉蒵떦썪켻鰽瀔伉() + 1)) ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(((0x21F78AD9 ^ 0x741) + -(0x8A87 ^ ((0x479A7FA ^ 0x47982D1) + -156))) ^ (0x21F6C30F ^ ((0x47AE ^ 0x593D) + -500)), 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺((1538971787 + -21) ^ (2071 + -23) ^ ((1855244689 + -709) ^ 0x215F), 0x1BD9D30D ^ (0x2F141677 ^ (((25548 + -22518) & -1) + -(~-901 + 1 + -1)))), 빈죆痈讕悽欑慱楂좲.秭贐턈튰줥賿鲩靐킭꿛匰櫌叭())), 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.翯컳菻媙骯隯써瘙쓓壮檸爌놵쭊橖笽鮊숰() ^ 빈죆痈讕悽欑慱楂좲.镼謵黳訐뤖딝흀淢혡(), 빈죆痈讕悽欑慱楂좲.蝌뚣歖翌귊百찚谆躔괈菔飺() ^ 빈죆痈讕悽欑慱楂좲.갊씊듨韠뼘딭秪阷()) ^ (韘줎麛퍜锉薑蔴啱潕꺐뷹.菴檝閦淚柠碙庑呄鳳땚椖睨셓뮥셋僧鲚辜粙(빈죆痈讕悽欑慱楂좲.梣坬觫灊뢠薩꺲素() - -(~(((((187807458 + -4263) & -1) ^ 0xE2F) + -((61084 + -936) ^ (~-9114 + 1 + -1))) ^ 0xB30CD14) + 1), ((((-728402586 ^ 0x6943) + -(0x13445294 ^ 0x13445181)) ^ (2340 + -72)) + -((2910 + -389) ^ (4612 + -(37514 + -23203 + -14163)))) ^ ((728434398 + -(34809 + -31357 + -2565)) ^ 0x5BB)) ^ 빈죆痈讕悽欑慱楂좲.疾쓪ム繍秮휆짤僜間痠웚姧戙될퐦蝡()))) ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(0x13632EF9 ^ (((19546 + -13244) & -1) + -(-270 ^ -1)) ^ 0x6A1F4EB ^ ((701364583 + -974) ^ 0x3F7) ^ ((~437705963 + 1 + -1) ^ 0x213A ^ -1 ^ ((437711512 + -324) ^ (~-1469 + 1 + -1))) ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿((((-1006963088 ^ ((24973 + -22082) & -1)) + -((24482 + -((23818 + -22867) & -1)) ^ 0x1A7D)) ^ (0x6BF13DAA ^ (38362 + -15190 + -16218)) ^ -1) - -((1640023239 + -(0x7EFC ^ 0x7CA7)) ^ 0x822 ^ 0x3BBD4FD7 ^ ((1518182119 + -949) ^ 0x1EAA)), -1867009354 ^ ((0x3271329C ^ 0x327122EB) + -571) ^ -1 ^ 0x6F484374), 韘줎麛퍜锉薑蔴啱潕꺐뷹.菴檝閦淚柠碙庑呄鳳땚椖睨셓뮥셋僧鲚辜粙(韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(((0x3071B4E ^ 0xA06) + -(0x3474 ^ 0xD45)) ^ ((50764196 + -(-800 ^ -1)) ^ (~-4842 + 1 + -1)), ((0x4EC95887 ^ 0x744) + -(0xD058 ^ 0x444)) ^ ((1321768740 + -475) ^ 0x250C)), -495175729 ^ ((1715162473 + -189) ^ 0x1E77) ^ 0x7BB89AEB)), (빈죆痈讕悽欑慱楂좲.鲩償帄攙遙鳾뚍缥軇惚춅繇閁蜷섡幤劼嬆럞俌() - -(~빈죆痈讕悽欑慱楂좲.诣떅뇉묬恡僻댪틔卻竰赨() + 1)) ^ (0x425CA9B7 ^ ((-9032 ^ -1) + -276) ^ (0x425CBEF4 ^ (((14288 + -8278) & -1) + -(14332 + -9891 + -3956)))) ^ (((0x6DB8C8E4 ^ 0x326A4FA8) + -95) ^ ((21044 + -19184) & -1) ^ (0x464F3FC3 ^ ((-5669 ^ -1) + -538)) ^ ((0x76671769 ^ 빈죆痈讕悽欑慱楂좲.릍삤鹚氌苫봈梳漀훋싋쌜퐂鸎С왌助팦屍()) - -(~빈죆痈讕悽欑慱楂좲.椹蒆딤嶷猽菞膐糩飳偓菵蠽붎胣镟() + 1)))), 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.鸷掎짼魊疢迱롯潛곥쨍땫工恏扒굱흑컑뢳() ^ ((~-1394492707 + 1 + -1) ^ 0x19DC ^ 0x7CC385A7 ^ 0x2FDDCBB8), 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.糌党꿞砍뿑乌胦鬹殞鎜筕(), (0x3CB74027 ^ ((36549 + -26907) & -1) ^ (0x3CB77A7E ^ (4546 + -627))) - -(~韘줎麛퍜锉薑蔴啱潕꺐뷹.菴檝閦淚柠碙庑呄鳳땚椖睨셓뮥셋僧鲚辜粙((0x6E3514FE ^ (8486 + -415) ^ (0x6E357732 ^ (3288 + -(~-951 + 1 + -1)))) - -(~빈죆痈讕悽欑慱楂좲.鏥喠擤棜욿嘛豽焯() + 1), -2041146299 ^ 0x79A96BBA) + 1))));
		num = (365976091 + -780) ^ 0x17A0 ^ (0x5F71070B ^ ((5691 + -846) & -1)) ^ (0x65C0652F ^ (6819 + -(~-841 + 1 + -1)));
		num2 = num3 ^ 빈죆痈讕悽欑慱楂좲.꿥蚏衵胔뉁炜榊莒窅葈鄏凌岴斃뭘툧쌤();
		return num2 ^ num;
	}

	private string 鐜霓극櫒嶞渼硛瓈햸퉁羳酗橬뤬()
	{
		return 鈋춹鑀憆燧濩雂支簲拍쵁灎.푙춣뇒澕錅캎炐檽獚똾憌("mOuKVjxenhu71SbTasycdb6TR4znX+tbhqbQHTiuEvvvMXf7J4vkG2B4zhpcg69ZzN330TwtsolnadQB/oX1oeuoV+iEplsL9o4rDj8TS74KhQPe8Y0vC6+brYdFPE4NsQ==");
	}

	public void 푰캈弭걣틚逷纲卜쓤灞蕦贫幹塒()
	{
		int num = 빈죆痈讕悽欑慱楂좲.駯챠챜趘덢牗쑿扌唵();
		int a = 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(-93230958 ^ (9576 + -12) ^ -1 ^ 0x5CD9451, 빈죆痈讕悽欑慱楂좲.턚빖츦茛衋韙낵附栯컝媁땓摌撘좼居쇩ゐ萢쟁()) ^ 빈죆痈讕悽欑慱楂좲.湙傋횣쨱籲밲挓뛻挎鏸邻桘渟() ^ (0x45378655 ^ (5735 + -673) ^ ((1715051545 + -939) ^ (6447 + -345)) ^ 0x7C871426 ^ (빈죆痈讕悽欑慱楂좲.鏓跆嫥铺達豱旛뛨쯫퐾졩딄뒵鱿() - -(~韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.蠒쏌뗎攗銦꾲못켧邍壉뽴蹩쌗划箫(), 빈죆痈讕悽欑慱楂좲.跂췐눠疰駹돵萣쭲簖桅輔屄佖亸鼒()) + 1))), 빈죆痈讕悽欑慱楂좲.鈍忝늠돺뺻倱댝븷() ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(빈죆痈讕悽欑慱楂좲.陃闑褢뒭햬穨뇇鄆翆筮뻘侅珀햏럪聰숀삥(), 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(0x7F4CA89D ^ ((~-2135734660 + 1 + -1) ^ ((0x539CDA58 ^ 0x539CC5CA) + -501)), 빈죆痈讕悽欑慱楂좲.慤鼽쳂軅蔱럷폿뀪眕齕멑誂())) ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺((((~-1805903128 + 1 + -1) ^ 0x199A) + -(0xB451 ^ 0x1FF4)) ^ 0x2C0D99B9 ^ 빈죆痈讕悽欑慱楂좲.쮍遮傧廫튤掵縎얀섛隸(), 韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.黄쐇凚款懲퉚瑐푟朰粑鶙幮굎叼僢푚(), 빈죆痈讕悽欑慱楂좲.긌筸쥔鴘좏韺宛뫵()), 빈죆痈讕悽欑慱楂좲.堉聃둮銛颊骥荽罩폒껑懰伛鱖寉纑쀑衏靅嬪涜()))) + -(~韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺((1353723477 + -695) ^ ((0x22C73F52 ^ 0x22C720D7) + -(0x2EA77988 ^ 0x2EA77972)) ^ (0x15EE52D9 ^ (~-2965 + 1 + -1)) ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.駆蕯鼑荝襵矬啶牿장飍댍떲軾籟矶붕灃슷溻绱(), ((0x74AD2C88 ^ (6006 + -280)) + -(0x4BD1 ^ (2415 + -396))) ^ 0x74ACA5ED), 빈죆痈讕悽欑慱楂좲.域캳曾籡摥虩넱햔먃泔췢蟬() ^ 빈죆痈讕悽欑慱楂좲.祚욅瘕뭶쫀犝嗨箖揻莎()) ^ (((((82176410 + -7267) & -1) ^ ((37136 + -30872) & -1) ^ 0x5CBF8F5 ^ (((0x420618E1 ^ 0x25775FCE) + -(0x1C5D790A ^ 0x1C5D79CE)) ^ 0xD67)) - -(~(0x7D623C47 ^ (((26762 + -19798) & -1) + -891) ^ 0x53C7C91E ^ (((0x2EA5D072 ^ 0x141E) + -635) ^ ((0x1F6B1862 ^ 0x1F6B3D27) + -576))) + 1)) ^ (0x71263243 ^ (20476 + -13838 + -2918 + -608) ^ 0x71261ED0) ^ (((((1762173767 + -956) ^ 0x1446 ^ 0xBDF841F ^ (0x4326E9CD ^ ((0x6152 ^ 0x42FC) + -151))) - -(~(0x588E8B11 ^ (~-4584 + 1 + -1) ^ (0x588E922B ^ (58678 + -25042 + -32140))) + 1)) & (((-1741535142 ^ (30262 + -14646 + -8448)) + -((52076 + -28005 + -7286) ^ 0x44F)) ^ 0x67CDF183)) ^ ((-1796790750 + -32633 + -27933 + -544) ^ 0x19C3 ^ 0x6F579A5E ^ (((72254542 + -13495) & -1) ^ 0xB5A) ^ (((-1617768828 ^ (7684 + -206)) + -(0x9BFF ^ 0x9C2)) ^ 0x606DBE8A)))), 韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(빈죆痈讕悽欑慱楂좲.炏忔횽鈥썑餒뤑쒄糋鞣軗(), 빈죆痈讕悽欑慱楂좲.젊엢朗媘痵籩羍뱟뉈迁엔캿覿冭()) ^ ((~-1171630168 + 1 + -1 + -(0x4F9603D8 ^ 0x4F9601A5)) ^ 0x140B ^ 0x45D5973A) ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(0x2EF6E2D9 ^ (0x470298CC ^ (~-8398 + 1 + -1 + -359)), 빈죆痈讕悽欑慱楂좲.蔃召爁줧篩璎媒磪볏溌琱俵褕衇()), 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.쾚폁痹휉쮈诫큥壂冁蝐忓弴憷警(), ((0x340453C1 ^ (9762 + -(0x3A7 ^ 0x39))) + -(0x97BA ^ 0x241E)) ^ 0x3403A515))) + 1);
		num = 빈죆痈讕悽欑慱楂좲.堑鮓숦磫좵둺馅脚();
		int num2 = 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(a, (1387821120 + -153) ^ (48332 + -18134 + -24226) ^ -1 ^ (0x19EF6D51 ^ (8694 + -700)));
	}

	public 焤쑨碋汶륄冠韽櫁풸뷣栀壓링憑啫黬伒()
	{
		焤쑨碋汶륄冠韽櫁풸뷣栀壓링憑啫黬伒.爐舄儱輂狅善账즱븄푸퀤닭兼駕慝帞焆 = "d4kROxLDzf5XXAUla";
		焤쑨碋汶륄冠韽櫁풸뷣栀壓링憑啫黬伒.敮榡륯騉瞻澁셢履蒂笣藎耹춆撗訊頰悔 = "biWk5rdIQSJeTQ";
	}

	private static int 癫吏巉峢虰沬亃搔蕾笙醝请읓렻뱐뫜鍘답憤忒()
	{
		int num = 0x480ACF5E ^ (0x480AC603 ^ (~-2369 + 1 + -1));
		do
		{
			num -= -(((0x35266FF1 ^ (3950 + -874)) + -(0x3BF3 ^ 0x112A)) ^ 0x35263919);
		}
		while (num < (0x199678B ^ (2355 + -651) ^ 0x1996397));
		return 0x371A8F80 ^ 0x371A8F80;
	}

	private static bool 燠薳퐏홧扚邨삸툗꿜뢴()
	{
		bool flag = true;
		if ((0x1B6A0261 & 0x19B2DEF2) == 0)
		{
			flag = false;
		}
		_ = 0;
		return false;
	}

	private static void 楧勢鲜碕聿婻玂毂틞띤()
	{
		bool flag = true;
		if ((0x29D6F948 & 0x64F8BD8A) == 0)
		{
			flag = false;
		}
		_ = 0;
	}
}
