internal abstract class 瞝洒蔚맖꽉麪孪舋墙呟龆
{
	internal static bool 煺豋鳰짩뿒僬쟙蛲濆镒琘 = false;

	private static string 븸耄糇釛捌慎녫踛 = "MGC3XYqYHm0CjLR5PMTQq";

	private static int 欙둰絡臷臮盁痨폂섯혟鬚聽믮勇쟍昹镟腃枃 = 1648685492;

	private static bool 鬢쒫퇚筢퐠띪蓴碠쬏刏缍婁マ耨卑뮨汿袹纫 = false;

	private static string 銷諓蘻雗낢걃伺種貞碓饦랯誮굲槢縑먺 = "VD8T3dKCky";

	internal static long 蕻깑쥰퓬喤밑韘跊 = -958811289772375842L;

	private static string 狹돞腧瑃秓둶琝皦嶚麬勠()
	{
		string text = 鈋춹鑀憆燧濩雂支簲拍쵁灎.푙춣뇒澕錅캎炐檽獚똾憌("pCE/HDAsAaZsFp/EqywRbJomQrSqsKZZ7gkTTbW+L8jzPBlFOYLZY3cA3lfwLfPx2RNmYeVldaKgIPjmRFn2IS+6fLNxAiaOb0wfwwuo7XAVBUi/qJ7djFWEweS5MJ8Ycw==");
		return 鈋춹鑀憆燧濩雂支簲拍쵁灎.푙춣뇒澕錅캎炐檽獚똾憌("YmZlmPrsela1Mj+/wJRflDVsvzS6WfZq8RATQi5WTrVvlD0qlRYejyO70yBgyH4y7znkgwcAgvxbESKjc4r3xkW9BI3WzkBRtAhQ8KXhaHXElhnRNa0YDYGXqZU8I8/heg==");
	}

	private static string 鷲惡습季폖蕦嫈柏馆쨲꿥凓듴()
	{
		return 鈋춹鑀憆燧濩雂支簲拍쵁灎.푙춣뇒澕錅캎炐檽獚똾憌("9jilW6oMpzxBRR4kgxnA9/GZiSmoG0r7odURu/gI2ePHA2lVuet+snspxEbHOFpSzs8ylXwe//i0qLvHyccFQ4IcoYmQzUShJj/tVJN46qakWVS4q5AzbcA3MQA6tShVIQ==");
	}

	public static int 쬁蘞緖縭줊읾뻘짦蟫誗矝를輼櫚쪧誷憟낔朢()
	{
		int num = 빈죆痈讕悽欑慱楂좲.툶颱傜痂龈む纘貨퀏軝번邹杤岥惮();
		int a = 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.摮跊등꽚鄌岰광췱帾脸왿쩡긺꾸(), (韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(빈죆痈讕悽欑慱楂좲.脈摛턣趖妎詈ズ纜唹춮攅碵젔(), 0x7C907508 ^ (0x7C9022B3 ^ ((0x77E0 ^ 0x6B4B) + -(~-440 + 1 + -1)))) & ((1831343467 + -353) ^ 0xF31 ^ -1 ^ ((1831342391 + -968) ^ ((0x49807C09 ^ 0x49806549) + -748)))) - -(~빈죆痈讕悽欑慱楂좲.嬚큋撕硁솜뉳緁堹蛠元쉶콭婏摵() + 1)) ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.康诚숻浇崃籆祎淥骈呑冗(), (((-231670460 + -680) ^ 0x21AE) + -(0x65CC ^ 0x2187)) ^ 0xDCF4971 ^ (((-1643068845 ^ 0x1FE9) + -(0x3552 ^ ((0x2FC0 ^ 0x3ED0) + -(44822 + -27839 + -16140)))) ^ ((1643070726 + -(0x7EADAB76 ^ 0x7EADAAEF)) ^ 0x19B1))), 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(((-502872076 ^ (~-7211 + 1 + -1) ^ -1 ^ (((1898252598 + -5187) & -1) ^ (32369 + -7326 + -21623))) - -(~(0x4682D758 ^ (4487 + -294) ^ 0x4682AC2C) + 1)) & ((-1553373733 + -649) ^ (6828 + -872) ^ (((-272868134 ^ -1) + -797) ^ 0x1B4A) ^ ((~-1289037527 + 1 + -1 + -953) ^ 0x13B6)), 빈죆痈讕悽欑慱楂좲.尟겨륏磷뮟베羾倕袑껛()), 韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(((((24047894 + -476) ^ 0xF73) + -(0xD0F9 ^ 0xBD5)) ^ 0x4B26E73A) - -(~(((0x34B25924 ^ (4425 + -617)) + -(0xF506 ^ 0x4D3)) ^ (0x34B1650D ^ (6870 + -103))) + 1), 빈죆痈讕悽欑慱楂좲.쑁퓩ヲ痀딟쳑껮懅糪샲恍츦芛穭塟()) ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(((0x13B6C147 ^ 0x1957) + -(0xC816 ^ (1409 + -277))) ^ 0x13B61CEA, 빈죆痈讕悽欑慱楂좲.徤륰꽗閇烡복辞溓茵녟꿯又徽눴慐멒螀())));
		num = 0x5D200F2A ^ (~-3425 + 1 + -1) ^ 0x8E30F15;
		int num2 = 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(a, 빈죆痈讕悽欑慱楂좲.햝瀂寸卷鯓碸콧쨯걐穎퍵똦睻혮뀰冏洊湉봈娛());
		int a2 = 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺((num2 ^ num) + -(~(韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(((~-1788529123 + 1 + -1) ^ (10474 + -(0x36A8 ^ 0x341E)) ^ 0xDCC9DFF ^ ((((360407925 + -21154) & -1) + -890) ^ 0x1AE6)) - -(~빈죆痈讕悽欑慱楂좲.吼蘑뜌쨮傰槓鯬仸꺃겒綞() + 1) - -(~((((((1811047980 + -14414) & -1) + -447) ^ ((0x59EC954 ^ 0x59ECE24) + -35)) + -(0x9F8C ^ (23791 + -15435 + -5652 + -(~-428 + 1 + -1)))) ^ (0x6BF1A03D ^ (21789 + -8212 + -7445))) + 1), 빈죆痈讕悽欑慱楂좲.覦籴쀀鳑夞幣睥鷃繕嶖扁狁냝窪() ^ 빈죆痈讕悽欑慱楂좲.笻嬟藱쪫퓮穖꺓칑솔粐惬頓寖瑁젨핱놉()) ^ 빈죆痈讕悽欑慱楂좲.澀앸骀쟓耷惜峖虩蟑졄칊烁蔑時궪(), ((0x22B03A83 ^ (~-8633 + 1 + -1 + -(0x5431A963 ^ 0x5431A843)) ^ (0xDB929E0 ^ (2072 + -778)) ^ 0x4DD18C04 ^ (0x6DD925D1 ^ ((21145 + -18169) & -1) ^ (0x2DCAF7F9 ^ ((-2808 ^ -1) + -394)))) - -(~(((-56726607 ^ -1) + -(-904 ^ -1)) ^ 0x584 ^ (0x36183F2 ^ (5752 + -330))) + 1)) ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(빈죆痈讕悽欑慱楂좲.涢쭽楙릊聓娆뻡藆혐洱쿕释梀癲(), 빈죆痈讕悽欑慱楂좲.忈衛돆舣賕垫謋늋爅뫆轌쨨뷲Ж() ^ (-1085796948 ^ ((0x56BE5A3D ^ 0x56BE5765) + -196) ^ 0x40B7FEC7))) ^ (((0x5A4AEE7E ^ 0x5A4AEF31) - -(~(빈죆痈讕悽欑慱楂좲.켢퉎츶霾厐푏뤉쾣挼扪厇憪쥧忷梪() ^ 빈죆痈讕悽欑慱楂좲.櫙幐笹뭳쀊딙믂憛蕗먺既컷홨좪极()) + 1)) ^ ((빈죆痈讕悽欑慱楂좲.藀蔽疲픫鬷鲼濒鄦() - -(~((((1937128211 + -30336) & -1) + -(-979 ^ -1)) ^ (9290 + -850) ^ (((0x7375B1BC ^ 0x578F) + -(0x754E8DD6 ^ 0x754E8C39)) ^ 0x4B6)) + 1)) ^ 빈죆痈讕悽欑慱楂좲.遛酐沩蘿춤饇鍚噌攇煤룉莀椨()))) + 1), 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.曺捼릌廗烹뭝솵탞爵튍劘뎎蓱쇩欣틱首() - -(~(0x3C1A75 ^ ((3938907 + -574) ^ (10274 + -395)) ^ (((0x382FFEE ^ 0x265C) + -((~-61887 + 1 + -1 + -(0x8076160 ^ 0x80761B7)) ^ ((6666 + -1205) & -1))) ^ (0x381DDFC ^ (3882 + -132)))) + 1), 빈죆痈讕悽欑慱楂좲.솷緖灵撏迟대轖憹鸁얜빑頍虜闚榈뎮宩뺟앹()) ^ (韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.홽릖鑑霠氋燀肗朇慇딿싌榹꽱쩋(), (-553906028 + -(0x7109818B ^ 0x710982F4)) ^ 0x17BD ^ -1 ^ ((259855664 + -(0x5DA15AD9 ^ 0x5DA15811)) ^ 0x10DA)) ^ (韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.싶薮佛鼖卽髻尰帣펽彾뇌賷蠸諌딐(), 빈죆痈讕悽欑慱楂좲.萧婩宲읈唑섨냸퀧欐猯畀ぐ첏俀镟챩鎴()) - -(~빈죆痈讕悽欑慱楂좲.縶滆夾恐뻬읾윽鰺頸蒓釣뱭퀂돞菛仿罬局钆俳() + 1))) ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(0x4DC4A53E ^ (32857 + -26765 + -2411) ^ (((555346185 + -8384) & -1) ^ 0x14B6) ^ (((1375459362 + -17387 + -28153) ^ (1626 + -493) ^ 0x51FB03C9) - -(~韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(빈죆痈讕悽欑慱楂좲.亿뢃囗胷럲犫宾椷탮閘봆탦诋妇蜑(), 0x117B80CB ^ ((~-293327963 + 1 + -1) ^ 0x624)), 빈죆痈讕悽欑慱楂좲.烈猡毗Л葑榷洬缋虇竐餆锂쪀鯍蘏()) + 1)), 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(((0x3FD7A3CC ^ (~-6160 + 1 + -1)) + -((36552 + -219 + -4733) ^ 0x1959)) ^ (0x19424604 ^ (8869 + -480)), 0x6D0A01F ^ 0x6D0843A)) ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.邱莌籧跦佗뛼叫閚롯翴黭욞() ^ ((0x533665A ^ 0x53341E6) - -(~((~-204904186 + 1 + -1 + -92) ^ (8813 + -753) ^ (0x1E931C27 ^ (10699 + -(0x2B7ECB39 ^ 0x2B7EC86B))) ^ ((312847038 + -(0x66535435 ^ 0x66535769)) ^ 0x161E)) + 1)), 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺((-1215621509 + -122) ^ 0x25EE ^ -1 ^ ((1082737487 + -(0x76C6 ^ 0x776C)) ^ (38911 + -29249 + -6214 + -379)), 빈죆痈讕悽欑慱楂좲.쌪蓾鬝푭翀宕샃疟俨姫벬谞꽰퉔編녉鈶())));
		num = 0x54F69AF ^ (0x6A34CC72 ^ (5351 + -(0x70E11A78 ^ 0x70E11B04)));
		num2 = 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(a2, ((((-478318681 ^ -1) + -(25903 + -6305 + -19357)) ^ 0x633) + -(0x5D5B ^ 0xE73)) ^ (0x73F9994D ^ (17195 + -9619 + -961)));
		return num2 ^ num;
	}

	internal static void 岪輮뿂Ж藘麬턻蒨鹗聪僩粅雳襈섙얣클뜐륰挆()
	{
		int num = 빈죆痈讕悽欑慱楂좲.痧屺蔢胼唯듃탎顓酯氦귡氰();
		int num2 = 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.陃縱鸅髁쵵햍頸讇() ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(빈죆痈讕悽欑慱楂좲.鳯俼趺皒靟亹瞋뱌궦젞替嚊痷뜕(), (209944960 + -14) ^ (6722 + -224) ^ (0x7E445781 ^ (8129 + -119)) ^ ((1925697583 + -(-145 ^ -1)) ^ (((23420 + -14765) & -1) + -964))) ^ (빈죆痈讕悽欑慱楂좲.苵糀쨧傐뼑閟镤齡뭛喎术嫞() ^ (-145150092 ^ ((145146719 + -854) ^ 0x1082)) ^ (-172681356 ^ ((18410 + -8741) & -1) ^ -1 ^ ((~-172682350 + 1 + -1) ^ 0x26C8))) ^ (빈죆痈讕悽欑慱楂좲.硚蠖덠톢쉶쁢謅舗() ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.菴檝閦淚柠碙庑呄鳳땚椖睨셓뮥셋僧鲚辜粙(韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(빈죆痈讕悽欑慱楂좲.뙀師켆涸룰阣뵦刡퉧洽黀皧撼酻塖钘끄켭呼(), 0x42F9C00F ^ (((512595621 + -6360) & -1) ^ 0x942) ^ (0x5C74A5D1 ^ (5006 + -(0x5EC340F ^ 0x5EC36C7)))), -214013955 ^ (0x6D58415 ^ (((18182 + -12903) & -1) + -(~-966 + 1 + -1))) ^ (0xA140365 ^ ((0x3B364D58 ^ 0x3B365C1C) + -(0x7599 ^ 0x7405)))) ^ (韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(빈죆痈讕悽欑慱楂좲.똬淵素쭿牊蒹晗憯洁殷贸泖(), (((853148098 + -402) ^ 0x2195) + -(0x2358 ^ 0x1BC6)) ^ ((853146763 + -980) ^ 0x10B6)) ^ ((빈죆痈讕悽欑慱楂좲.辳鸤룭央鈟쁼훤엉똪嫊톖螗댮悎츾鯐緐弣죘() ^ -1) - -(0x6A1F301B ^ 0x6A1F301A) - -(~((-1821725489 + -(0x2A33CC51 ^ 0x2A33CCEE)) ^ 0x1207 ^ -1 ^ 0x6C9541E9) + 1)))), 0 ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(0x1727ABAF ^ 0x3B3798C8, 빈죆痈讕悽欑慱楂좲.勴憩褑뢮偸팒瓾粽鱽별뎠램绚())) + -(~(韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.겭쫻眍衛廬审唼路В怛茭蒮隿() - -(~((1179375904 + -8695 + -2329) ^ 0x25BE ^ ((1838590653 + -(32572 + -28864 + -3050)) ^ (51459 + -18331 + -23618)) ^ (0x2BDD3601 ^ (8331 + -(-951 ^ -1)))) + 1) - -(~빈죆痈讕悽欑慱楂좲.澼酙월妅鰄섁쏗竺戃я喧() + 1), 빈죆痈讕悽欑慱楂좲.豅髭樒턊绎曟單澅讄倴熴촙ц먧笮()) ^ (((0xDCB2A8E ^ (0x3D3117E8 ^ (~-7015 + 1 + -1 + -883))) - -(~(0x2548350D ^ (21493 + -10032 + -8856) ^ 0x25482398) + 1) - -(~빈죆痈讕悽欑慱楂좲.憧痦癇靄級僓姲堕춓髢屪镼頼特() + 1)) ^ ((757093473 + -348) ^ 0xA3D ^ (0x2D207C58 ^ (~-8253 + 1 + -1)))) ^ ((((775193116 + -24016) & -1) + -(0x2F7EF610 ^ 0x2F7EF778)) ^ 0xDAA ^ -1 ^ 0x2E342F4E) ^ (((-490975911 + -243) & -1) ^ (7779 + -(-899 ^ -1)) ^ -1 ^ (0x1EB40D76 ^ (4398 + -911)) ^ ((1932518672 + -834) ^ (57640 + -31257 + -23476) ^ (0x109B8078 ^ ((-6197 ^ -1) + -(0x68E7 ^ 0x6901))) ^ 0x63B479CA) ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.盎羥鎶髖藈烍厍룱椿篰琫봻汹沕텟奎얪() ^ (-1680802379 ^ (0x642F105B ^ (5267 + -642))), 빈죆痈讕悽欑慱楂좲.琟晄쏀꺌觜暆衢跬廭偧뮏坦讫()))) + 1);
		num = 빈죆痈讕悽欑慱楂좲.旼燮튊踺蓫怘촉沢嬊钘姹桄嗠欼씝쌣();
		int num3 = num2 ^ (-1062131930 ^ (~-10003 + 1 + -1 + -(-563 ^ -1)) ^ ((~-683575770 + 1 + -1 + -729) ^ ((-3975 ^ -1) + -952)) ^ ((2048240373 + -(0x24434295 ^ 0x244341F1)) ^ 0x1576));
	}

	private static void 럚낚磤묩杋췍작瓋宿떄훴쉔뚎롵粙鷿()
	{
		int num = (-1767449999 + -181) ^ 0x4AA ^ (0x891BBE4 ^ ((38519 + -30508) & -1));
		num = (num ^ (-1226820105 ^ ((0x53DB ^ 0x448A) + -561) ^ -1 ^ ((229589602 + -(0x64DF ^ 0x649A)) ^ 0x204A))) << ((470783137 + -484) ^ (10578 + -(33020 + -24326 + -7807)) ^ (((470811058 + -21084) & -1) ^ (6691 + -(0x3C09727 ^ 0x3C09526))));
		num = (num ^ (((1589835466 + -31204) & -1) ^ ((-5916 ^ -1) + -259) ^ 0x280106F8)) << (0x610D98AC ^ (0x610D9655 ^ (~-3918 + 1 + -1 + -(0x4CA59063 ^ 0x4CA59030))));
		num = (num ^ (0x4CADCDD7 ^ (8373 + -527) ^ 0x6E05B693)) << (0x83E0B8A ^ ((321805625 + -(20091 + -11740 + -7697)) ^ 0x1245) ^ 0x1B10437D);
		num = (num ^ (0x2A888E36 ^ ((~-1701875535 + 1 + -1) ^ (~-4561 + 1 + -1 + -819)))) << (((0x372CF713 ^ 0x144E) + -((23762 + -(~-414 + 1 + -1)) ^ 0xAEA)) ^ 0x372C917F);
	}

	private static int 쿸欤췧競汕呱蚟틻捐勥腥凵釧()
	{
		bool flag = true;
		if ((0x4C20D27E & 0x7FC1945F) == 0)
		{
			flag = false;
		}
		_ = 0;
		return 0;
	}

	private static int 컈儍睐籴쉢螤楱歾뒬嚚峎辉꺴()
	{
		int num = 15;
		do
		{
			num += 4;
		}
		while (num < 313);
		return 0;
	}

	private static bool 釔쐲뒠蕆桪鍫뺻輒()
	{
		bool flag = true;
		if ((0x1FADB78B & 0x4B225985) == 0)
		{
			flag = false;
		}
		_ = 0;
		return false;
	}
}
