using System.Runtime.CompilerServices;

internal static class 禱伕偮追惷譮뉜诬厩坷跧悾젱猌恤엑礫禧쮻
{
	[MethodImpl(MethodImplOptions.NoInlining)]
	internal unsafe static void 夥傮琳嗝靴堺걛만嫌應櫂퇂()
	{
		_ = stackalloc byte[((0x6F3AD101 ^ (35868 + -29764 + -2536)) + -(0x9315 ^ 0xF22)) ^ (((0x5A2B493B ^ 0x35112AD8) + -(0x1729 ^ 0x1430)) ^ 0x2042)];
	}

	[MethodImpl(MethodImplOptions.NoInlining)]
	internal static void 肅落竦췢馱逺事듯꾬耏폻툓결懚ぁ儂衍甬()
	{
		try
		{
			_ = 402663988;
		}
		catch
		{
			_ = 1055301937;
		}
	}

	private static bool 訥禦뺺痴늆툴퀭單신퀴縐()
	{
		bool flag = (byte)(0x5B9607A2 ^ (5910 + -((13575 + -12637) & -1)) ^ ((1536599305 + -30591 + -5138) ^ 0xDB7)) != 0;
		if (((((0x4D7FDA59 ^ ((29307 + -28153) & -1)) + -((56397 + -(0x8A2 ^ 0xBDC)) ^ 0x15E9)) ^ (((1988182244 + -27995) & -1) ^ (7745 + -(0x66E671D6 ^ 0x66E67339)))) & (0x464C4BC0 ^ (0x713DD144 ^ (~-3448 + 1 + -1)) ^ 0x3DEF62F)) == ((573579041 + -959) ^ 0x20E8 ^ (((0x22300B35 ^ 0x203A) + -13) ^ ((0x8E2AFD3 ^ 0x8E2BDB2) + -(~-474 + 1 + -1)))))
		{
			flag = (byte)(((0x6E22174A ^ 0x1CC1) + -((42845 + -997) ^ 0x190B)) ^ ((1847686649 + -117) ^ 0x249C)) != 0;
		}
		_ = ((0x639F285A ^ 0x229C) + -(0xDF10 ^ (7312 + -(~-361 + 1 + -1)))) ^ 0x639E468E;
		return (byte)((((1501970461 + -104) ^ (34610 + -19495 + -7928 + -561)) + -((~-38798 + 1 + -1) ^ 0x781)) ^ (0x5985B36F ^ (21740 + -1426 + -10806))) != 0;
	}

	private static int 쑙鏈箾衲왳봢쾓뜞섐쨠鬨脝鰘矛孭캒츃鿍떺()
	{
		bool flag = (byte)((49692723 + -322) ^ 0x24AE ^ (0x23302427 ^ (5471 + -(0x366D6AB ^ 0x366D5A9))) ^ ((~-566639541 + 1 + -1) ^ 0x1790)) != 0;
		if ((((1568041579 + -891) ^ (~-2274 + 1 + -1) ^ 0x2D17D742) & (((0x22D0B5CC ^ 0x1469) + -(0x15C4 ^ 0xF94)) ^ (((49943313 + -31861) & -1) ^ 0xE96))) == (((0x5D84F4D8 ^ 0x1EF0) + -((75762 + -25850 + -12839 + -(~-910 + 1 + -1)) ^ (10092 + -811))) ^ 0x5D844123))
		{
			flag = (byte)((1518005325 + -370) ^ 0x2139 ^ (((1518025803 + -27931) & -1) ^ 0x4D2)) != 0;
		}
		_ = (~-1635385938 + 1 + -1 + -236) ^ 0x1571 ^ (0x617A0443 ^ (((22144 + -17518) & -1) + -443));
		return 0x1396F2A0 ^ (31203 + -16797 + -4997) ^ ((328653706 + -(0x2CD2 ^ 0x2D5C)) ^ ((0x4316 ^ 0x52B0) + -(0x19C1 ^ 0x1BC8)));
	}

	private static void 쑁픝衤菄饯嬹갭퍑굒蝽捎뱟牢踯岒缑()
	{
		bool flag = true;
		if ((0x1DA6F884 & 0x6CDBDC48) == 0)
		{
			flag = false;
		}
		_ = 0;
	}

	private static int 넋庅殃遝閲菜鞨똢繣녿筱()
	{
		int num = -1640531527;
		num = (num ^ 0x2E813749) << 20;
		num = (num ^ 0xCFF41CD) << 17;
		num = (num ^ 0x27E1C91C) << 11;
		num = (num ^ 0x1F103E38) << 2;
		num = (num ^ 0x1FD7214A) << 26;
		return 0;
	}
}
