internal abstract class 腥烃텊뵭큁茀揓哭碹摭駪
{
	internal static string 殐埣춑螬뮀鎶袶舂튘퀉佥 = "ggvZr4vmYywNVcY2x9Hf1l8A4PJ2A";

	public static bool 퀼硚銗秆潫꾏貼핱墀地싋缕溷畆湮莊髭 = false;

	public static string 엻팹皧댴祍撹격黬墲瘟슸湈涴 = "bIC5ITiYr9YvhjR";

	public static long 觾묄캮곻厂짨聓媼燴睴捞慐治轃日蜁爸刜뺸 = -4011038827302996834L;

	public static string 囿叏菢槹횰竎냫鯹鞣掍循쇜섟톺첻 = "ZxXjegTah7j56MuDVHwYk1Ee";

	private static long 縻餗糸듓핚렰긶훖邜擭쾡帬藷鴪 = 5545085192251485897L;

	private static int 醇뜵삯滲퍸숟賾炏()
	{
		int num = 빈죆痈讕悽欑慱楂좲.皙鸦홈她驷炥晶민軜();
		int num2 = 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺((-2130812729 ^ (~-9539 + 1 + -1) ^ 0x3D98C3CE ^ ((((568863714 + -26135) & -1) + -(-692 ^ -1)) ^ (9131 + -(0x59EC037B ^ 0x59EC00A6)))) - -(~韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(0x39E63AC1 ^ ((1973640859 + -((31711 + -31328) & -1)) ^ 0x2471), 빈죆痈讕悽欑慱楂좲.廩瑲磚鲒輡蛧슚퐶넅杩퍯秕씮()) + 1), 韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(((0x74722992 ^ 0xBC8) + -(((6490 + -6305) & -1) ^ (5914 + -804))) ^ 0x74722BD3, 빈죆痈讕悽欑慱楂좲.땱弤暦돢斐憹瑲넯囤뻍씉殨泗霭() ^ 0x2269)) ^ ((((58183535 + -(32504 + -21441 + -10668)) ^ 0x1DAE) + -(0xA5B2 ^ 0x15D3)) ^ (0xC51E144 ^ (30058 + -3640 + -16815)) ^ (0x5EEFEE14 ^ (29427 + -16207 + -5281 + -(0x7E497162 ^ 0x7E497376)) ^ ((683282489 + -(~-426 + 1 + -1)) ^ (9082 + -719)) ^ ((1985343823 + -986) ^ (61946 + -23584 + -29148)))) ^ (-1159879564 ^ ((9919 + -7370) & -1) ^ (((0x72D2C213 ^ 0x26A0) + -577) ^ ((15108 + -11921) & -1)) ^ 0x37F0BC7F) ^ ((빈죆痈讕悽欑慱楂좲.멯揂媨舿炇夌箤쮫錑튞鯒蓱뉰() - -(~(((0xDADEE91 ^ (~-9027 + 1 + -1)) + -((81460 + -12684 + -10431) ^ 0x2232)) ^ ((229448440 + -445) ^ 0x106D)) + 1)) ^ ((60068652 + -35) ^ ((36936 + -32260) & -1) ^ 0x394A496) ^ ((((0x3EC82FDF ^ ((1708416684 + -584) ^ 0x1243)) - -(~빈죆痈讕悽欑慱楂좲.졈意푧볆觑箬衃囯訷霳稔嬼蕞橿醰뭗灩朁氳() + 1)) & (((-2075470544 + -26373) & -1) ^ (42070 + -15016 + -17206) ^ 0x7BB5B7AC)) ^ 빈죆痈讕悽欑慱楂좲.츺傘얷켹镭脢窓欝鼏룧锷둫馦쇆昿()));
		num = 빈죆痈讕悽欑慱楂좲.졅蚆몪桱큲끰넮軯唜戼鼨帖竁뮇꼦臂();
		int num3 = num2 ^ 빈죆痈讕悽欑慱楂좲.졅蚆몪桱큲끰넮軯唜戼鼨帖竁뮇꼦臂();
		int num4 = 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺((num3 ^ num) + -(~韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺((韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(빈죆痈讕悽欑慱楂좲.彍큶쒡狼刞栟喟三樗荚(), 0x3C9D7D50 ^ 0x3C9D1034) - -(~(((0x631A71BE ^ 0x4E9D0529) + -(0x65DE1DB7 ^ 0x65DE1F53)) ^ 0x1908 ^ 0x4966E150 ^ ((1692530685 + -496) ^ 0x1A96)) + 1)) ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(0x43EE7968 ^ 0x5479E7B8, ((0x3A4BAECC ^ ((0x6155 ^ 0x75B7) + -944)) + -(0xE0E2 ^ 0xD09)) ^ ((~-769478193 + 1 + -1 + -283) ^ (4037 + -975))), (빈죆痈讕悽欑慱楂좲.仭鵌贐鬼儰쫐쪵솆菻傲鬛檻眍瞏윎耢릞() - -(~빈죆痈讕悽欑慱楂좲.쟿읕嚲恥辄蝉죳祂硹쌗() + 1)) ^ (韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(빈죆痈讕悽欑慱楂좲.뇻杙덋淜펴賳草곏僝姗螕() - -(~((((~-342440645 + 1 + -1 + -156) ^ ((31334 + -28771) & -1)) + -((21592 + -194) ^ 0x1142)) ^ (((0x1468E6BF ^ 0x5D77) + -643) ^ 0xFD6)) + 1), 0x6222B0D7 ^ (4417 + -950) ^ ((537557733 + -223) ^ (31614 + -6994 + -21339)) ^ ((1109991122 + -17994 + -4874) ^ (56577 + -29528 + -24147 + -((2978 + -2829) & -1)))) - -(~(((0x6D84FF6F ^ 0x21F3) + -(0x604D ^ ((18656 + -14231) & -1))) ^ (0x6D847E68 ^ ((23293 + -18577) & -1))) + 1))), 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺((빈죆痈讕悽欑慱楂좲.앃핫懭辫늫蹚판抴뾠玤밿禼鎩鼲옫媹劷똖꾑() - -(~(0x6964EBBD ^ (((1768217033 + -4575) & -1) ^ 0x21F3)) + 1)) & -1, 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.咎雵뗍샽쮝풂竽숿蒋뜡떱岈脱횃椓(), ((-1223247748 + -(~-293 + 1 + -1)) ^ (63350 + -31487 + -29240 + -(0x86CAB9 ^ 0x86C8EB)) ^ -1 ^ (((1223257239 + -5146) & -1) ^ ((0x220F ^ 0x2CBC) + -(~-338 + 1 + -1)))) - -(~(-634 ^ ((~554899157 + 1 + -1) ^ 0xD78 ^ 0x1E533840 ^ 0x3F4023ED)) + 1)))) + 1), 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.窈콂挹슌紌굔荛缝芽穖() - -(~韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(0x60808916 ^ (0x683CFB65 ^ (21430 + -5045 + -13217)), 빈죆痈讕悽欑慱楂좲.畈鹫疁髞牫臩찜샘演沎碓鮱뗌恎巂뗌啰()) + 1), 韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿((((0x4D3EBEC3 ^ (9321 + -876)) + -(0xC7CA ^ (~-2599 + 1 + -1))) ^ ((1295844452 + -450) ^ 0x263B)) - -(~빈죆痈讕悽欑慱楂좲.겧퀮铉茐끽럕嬘鎣쒩持绞悋睶缆鈎() + 1), 0x4E4220E6 ^ (0x4E425072 ^ (41717 + -9877 + -29650)))), (韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(빈죆痈讕悽欑慱楂좲.劦撚寻崉萍뉂貹抛톢춴以(), 빈죆痈讕悽欑慱楂좲.蔐꼮氻켫竛섪매臌巔짛톼镐()) - -(~((-1934537901 + -50 + -31162) ^ 0xE46 ^ -1 ^ (0x734F2C0F ^ ((0x2CCD ^ 0x3EAC) + -(45755 + -20410 + -24436)))) + 1)) ^ ((빈죆痈讕悽欑慱楂좲.뙫铤똋苁孺첻터嚔蛷媙탋骘퀋幺() ^ -1) - -(((0x72A965C1 ^ 0x26E92D27) + -81) ^ 0xE16 ^ (((0x576ECCCB ^ 0x32EAF70) + -916) ^ 0x26A5)) - -(~(((0x4525562 ^ 0x16B3) + -(((77131 + -22791) & -1) ^ 0x23FC)) ^ 0x4514C18) + 1))), 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.萼缟褒멭뗠빤宄扫칩蝖뵓路鳆崲庸恮檂鈥鯌녰(), 韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(빈죆痈讕悽欑慱楂좲.멻띾쌘ム啘檵햽镜猔(), 빈죆痈讕悽欑慱楂좲.艴꾡뽿픳뙙膏搿쌽눠鮮罩뽆()), -1796968034 ^ ((-6693 ^ -1) + -(0x4F4A ^ 0x4D57)) ^ -1 ^ 0x6B1BE2AF) - -(~韘줎麛퍜锉薑蔴啱潕꺐뷹.菴檝閦淚柠碙庑呄鳳땚椖睨셓뮥셋僧鲚辜粙(빈죆痈讕悽欑慱楂좲.痋羓由턅甯퇎댺啤甅蒭샔궎齄鶞륵굸鑶嵫颈鰜() - -(~(((0x3EAD641D ^ (50375 + -17889 + -26646 + -140)) + -((61136 + -602) ^ 0x6C9)) ^ 0x3EAC9609) + 1), -1364583589 ^ 0x5155E4A4) + 1)), 韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(((0x722E2E19 ^ 0x4E2) + -(0xC12E ^ 0x17F4)) ^ 0x5C319FC9, 빈죆痈讕悽欑慱楂좲.箥숛섔徣耂뚂匳늵쵺()) ^ ((빈죆痈讕悽欑慱楂좲.뙟틙밒踓駐럋煔굾() ^ -1) - -(-889346709 ^ (63586 + -30858 + -23378 + -270) ^ -1 ^ (0x35026536 ^ (7560 + -173))) - -(~(0x4E87EF51 ^ (6448 + -793) ^ ((1317531535 + -843) ^ 0x1503)) + 1)))) ^ (韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(빈죆痈讕悽欑慱楂좲.靾泧婟殺홏璕埛뮕艮抵幰謳뺅揰섔퇊(), (빈죆痈讕悽欑慱楂좲.证빓쳐格곷穒缯笕坥뉙윀屻恬쵑瀓() - -(~빈죆痈讕悽欑慱楂좲.퓺冏즨渶霨쉨슱甘튑鰿郇믺雏콾() + 1)) & ((-1420832971 + -20736 + -28188) ^ 0x2523 ^ 0x54B0CAC5)), 빈죆痈讕悽欑慱楂좲.튢鏭冥泑誤롒翦칔쨹닔졈쯛駠桿갊滳洇영()) ^ (빈죆痈讕悽欑慱楂좲.섮归켏낄햗괦퍅顿() ^ 빈죆痈讕悽欑慱楂좲.兾섮髙믪律츣찁鐈宷굱봒() ^ 빈죆痈讕悽欑慱楂좲.闛嫞휓錆늭츱榗妉獷稼炰출錫孁鵎傄윷())));
		num = -1400465872 ^ ((743164352 + -(-742 ^ -1)) ^ 0x1784);
		num3 = num4 ^ 빈죆痈讕悽欑慱楂좲.靎輂悙徇짆嗻壁奏();
		return 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(num3, num);
	}

	internal static void 韭믴脗췊쾀셻콬継()
	{
		int num = -289741562 ^ (0x6E9D305A ^ ((27978 + -23195) & -1));
		int a = 韘줎麛퍜锉薑蔴啱潕꺐뷹.蔜唴뢽銮珶鑺쩆禃퉿(韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(((((((-459446338 + -7236) & -1) ^ 0x2146) + -(0x2ECE ^ (~-6552 + 1 + -1))) ^ 0x786BC774) - -(~((-994766318 + -181) ^ (4832 + -439) ^ -1 ^ (((994784933 + -19516) & -1) ^ 0x1745)) + 1)) ^ (빈죆痈讕悽欑慱楂좲.꾊琢壉怭霺嗠甬氚兤쾟幄濚뚘뚟详텼껦() ^ 빈죆痈讕悽欑慱楂좲.넊榅儺熜졮낞哵囩滖錹荄梻츉蜵騤()), 韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(빈죆痈讕悽欑慱楂좲.醰봋枞最넙쒭櫰웊飚墈(), -1944484971 ^ ((12939 + -10009) & -1) ^ -1 ^ 0x73E676C2) ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿((빈죆痈讕悽欑慱楂좲.뭻쒄백걖斯柑逰罛읮듷纵荗翎堨赁뺭릖() ^ -1) - -(0x5EF50551 ^ (2646 + -(31904 + -22367 + -8953)) ^ ((2050345861 + -29529 + -5921) ^ (3081 + -(53909 + -21944 + -30967))) ^ ((616589478 + -428) ^ 0x228C)), 0x3F23C47C ^ ((1059317182 + -983) ^ 0x259A))) ^ ((-1489940110 + -853) ^ ((35726 + -29415) & -1) ^ 0x503DB2A ^ (0x5DCD51FC ^ (9548 + -441))), 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.菴檝閦淚柠碙庑呄鳳땚椖睨셓뮥셋僧鲚辜粙(韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿((289361043 + -21316 + -21947 + -462) ^ 0x15EB ^ 0x145C1FC8 ^ 0x32CDDFBB, 빈죆痈讕悽欑慱楂좲.쁍亇꺳굚镽斵늩뛎袬쏹쐁호戓끥볖퉟焝樉()), -1844068169 ^ (0x6DEA3273 ^ (((18616 + -14867) & -1) + -362))), 0xC0B4E0C ^ (~-2546 + 1 + -1 + -820) ^ (((202082266 + -11462) & -1) ^ 0xC28)), 빈죆痈讕悽欑慱楂좲.쪰檅パ纠哋뚄蒎忬空뽳寈撟勰裾() ^ 빈죆痈讕悽欑慱楂좲.뱛囲吡嬒濍靃텑蚅())), (韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.뀄鋾죙鎪눝鸥蔓뺯瀩甫욉隻뽣魡骮칹巟(), 빈죆痈讕悽欑慱楂좲.磶컾秔걋븁踁寃쮮()), (348798688 + -480) ^ (27149 + -8039 + -16776) ^ (((0x6C54E117 ^ 0x16634E5C) + -(33290 + -568 + -32135)) ^ 0x13F3) ^ 빈죆痈讕悽欑慱楂좲.쬮拻퇟쪩턃뮣溵뉩赇앎좈蕳돸笧璽찙땨()) - -(~(빈죆痈讕悽欑慱楂좲.蠀풛蜊蓬搽廞酺餢輪綻傪룋箟蓘븓() ^ ((빈죆痈讕悽欑慱楂좲.醈鱺痮舦촪뻥酵쳅婘嘛泻飀鲡钞切럕喉쮌鼼캶() ^ ((2087543571 + -456) ^ 0x1DCA ^ (0x4FB7C456 ^ (46072 + -13199 + -31737)) ^ (((0x7FBA6F7B ^ 0x14F8) + -483) ^ (10524 + -(-777 ^ -1))))) - -(~((-1278401685 + -153) ^ 0x7DA ^ -1 ^ 0x1E9E5816 ^ 빈죆痈讕悽欑慱楂좲.蜉홢뿱秵碨浀좝꺰롉詶葷()) + 1)) ^ (빈죆痈讕悽欑慱楂좲.뱾셂꿧雲琉낼골菭釩瞅嬒즇큞퐤툯碥() ^ (0x27F46857 ^ ((~-670331464 + 1 + -1 + -((17290 + -16666) & -1)) ^ (~-6901 + 1 + -1))))) + 1)) ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺((-39896664 ^ ((364128457 + -(0x2971 ^ 0x2B07)) ^ 0xF71) ^ -1) - -(0x5EDC102F ^ (10264 + -375) ^ (0x5EDC1615 ^ (18887 + -940 + -9601))) - -(~((-404126690 + -533) ^ 0x1C56 ^ -1 ^ 0x181661A1) + 1), 빈죆痈讕悽欑慱楂좲.뀲螶봿윀꽾坰鶻趠唡镈鉬()), 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.欆禲霞쀧텠쏰뜪秄憪뤣柀혢讐뉋屴졁(), 0x34A6B8BF ^ ((883334452 + -905) ^ (10590 + -679)))));
		num = 빈죆痈讕悽欑慱楂좲.脻簧犴邿绾唈侱黜믑姱뛂勲噃毘尻孂묖珓핶轭();
		int num2 = 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(a, 빈죆痈讕悽欑慱楂좲.脻簧犴邿绾唈侱黜믑姱뛂勲噃毘尻孂묖珓핶轭());
	}

	private static int 縧熘묓狨걃쫁뻪擩漰儹옱啞龇륿黹()
	{
		int num = (2008009164 + -(-511 ^ -1)) ^ 0x133F ^ -1 ^ 0x166752B7;
		num = (num ^ (((0x4AF40D58 ^ (6804 + -334)) + -(0x48FF ^ 0x1635)) ^ 0x37715B53)) << (((0x75DF67B0 ^ 0x15EE) + -(0xB1EF ^ (3854 + -514))) ^ (0x75DEA500 ^ (~-4208 + 1 + -1)));
		num = (num ^ (((-1980995004 + -12545) & -1) ^ 0x1219 ^ -1 ^ (((581983685 + -18753) & -1) ^ (3858 + -(0x782C30B6 ^ 0x782C317B))))) << (0x797DF1BC ^ (0x797DFD9F ^ (3644 + -512)));
		num = (num ^ 0x450A4540) << ((-1818254960 + -649) ^ (53130 + -32633 + -16186) ^ -1 ^ ((1818256267 + -359) ^ (16908 + -11778 + -494)));
		num = (num ^ (0x5F07D8DC ^ ((0x4CE82038 ^ 0x4CE80597) + -855) ^ (0x59F5065F ^ ((16448 + -15226) & -1)))) << (0x7101B751 ^ ((1895967183 + -30731 + -211) ^ 0x7AB));
		num = (num ^ (((0x400195AA ^ 0x1FA8) + -(0xA3B9 ^ ((30460 + -25192) & -1))) ^ (0x7881371B ^ (3993 + -477)))) << (0x1413A18B ^ 0x1413A18C);
		return 0x296F9B5B ^ 0x296F9B5B;
	}

	private static void 韬澫陭嬞읁줏珊꾃梩섛豲郹읇ォ館氊껸뵚뷪畂()
	{
		int num = -1640531527;
		num = (num ^ 0x73F37B5E) << 29;
		num = (num ^ 0x1DDCAE2B) << 5;
		num = (num ^ 0x14A30D6D) << 31;
		num = (num ^ 0x57971EAC) << 25;
		num = (num ^ 0x572D003D) << 13;
	}
}
