internal abstract class 龸鴿뛥蠄倉啦쒋鳑吏僩怨臍쯦簽羧
{
	private int 潼쫼폋慉叹뫷칃濘撓痥餷楎齐쪪渺;

	private int 殂춵셚嶐檆禲绳З菌獰;

	public long 횥楛쪚谥錉蒮驵骜悭뤌ب奅绅歳爊炠躥逋;

	internal string 魢艟釼蚽뢩驵戣筝郉掫座矄舺朴()
	{
		return 鈋춹鑀憆燧濩雂支簲拍쵁灎.푙춣뇒澕錅캎炐檽獚똾憌("Ko0aNpByMMHNoSOfBmzESqAL5jeWeeh4UsjacrRCQsDCOoIFFAA6n6dU1bUClpzK4pWr/yGUCgsc3irhsiCu4fEVDzAoUIjrrFCLHnuaHX9JrVy3BnjQMGLCdOMY3A7Eeg==");
	}

	internal void 螪찵츤掭锒箳놇千恄놓량뽿슙()
	{
		int num = 빈죆痈讕悽欑慱楂좲.똱椸憻颽麰缱粜僦映鋋儿즒磢돹됭初뷈氭渣();
		int a = (韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(-901141245 ^ ((35570 + -32711) & -1) ^ -1 ^ ((1880118662 + -381) ^ 0x238D) ^ 빈죆痈讕悽欑慱楂좲.美쒘俔엱帅辛녜鍂敩() ^ (0x7073F5C2 ^ 빈죆痈讕悽欑慱楂좲.풿濔찥슩傆哟煎蔠() ^ 빈죆痈讕悽欑慱楂좲.쬏쌎鼬欬黇슈搥猿绳萼퍼廚틭죳즠諷줽晕獮()), ((((0x7F01CC94 ^ 0xA50) + -588) ^ (35447 + -3695 + -25683)) + -(0x703E ^ 0x642)) ^ (0x6EF13362 ^ (((31272 + -22600) & -1) + -765)) ^ 빈죆痈讕悽欑慱楂좲.将놣샾쌡弅閯뤎픐距끤갾롲祮瘓() ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿((~-1358148549 + 1 + -1) ^ 0xDBA ^ (0x41036189 ^ (36003 + -8758 + -25895)), ((0x63616403 ^ (((28437 + -20930) & -1) + -746)) + -(0x7BA2 ^ (46854 + -31875 + -13786))) ^ (0x6360888C ^ (10520 + -785))) & (-422661884 ^ (8253 + -(0x5B53077C ^ 0x5B53050E)) ^ 0x19315330), (빈죆痈讕悽欑慱楂좲.汉렆騲粆做톄楍猯寷榐쳕仃() ^ -1) - -(((0x30B6740D ^ 0x10FC) + -(0xF23E ^ 0x110B)) ^ 0x30B581BD) - -(~(0x226684CE ^ (6156 + -616) ^ 0x5F05D3BD ^ (0x7D635F55 ^ ((0x18F7212C ^ 0x18F73EF1) + -(0x17A9 ^ 0x15F3)))) + 1))) ^ (韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(0x6739EAF7 ^ 0x68203361, 빈죆痈讕悽欑慱楂좲.佶硸廬옭햄픛뺩晜企뿘夘嘈噪()) - -(~(0x693792F8 ^ 0x6937CF8A) + 1) - -(~(0x3CFA18EF ^ 0x3CFA182D) + 1), 0x680E34AC ^ ((~-1745762004 + 1 + -1 + -123) ^ 0xE42) ^ (0xFF436DB ^ (6732 + -((31108 + -30234) & -1)) ^ (0x7BEF4C44 ^ (7814 + -648)) ^ ((~-1947957685 + 1 + -1) ^ (8888 + -566)))) ^ ((韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(빈죆痈讕悽欑慱楂좲.봆뉝믋査봏鶡輂鸞뚾濑(), 0x690BBD23 ^ (3090 + -(52253 + -29440 + -22156)) ^ ((2024327559 + -(-977 ^ -1)) ^ 0x2263) ^ 0x11A31500) & (-133131430 ^ ((0x1145 ^ 0x303E) + -663) ^ 0x7EF7241)) ^ 빈죆痈讕悽欑慱楂좲.瀅跈쩜缻뇷驗槔鏝筐튋払鈾붴몑篷輍慌樹()))) + -(~韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(((0xBB15BC4 ^ (((657134890 + -19848) & -1) ^ 0x1F3A) ^ (((0x5B717ADA ^ 0x42316D79) + -78) ^ 0x17B8)) - -(~(-276485411 ^ ((14963 + -12898) & -1) ^ -1 ^ ((276484700 + -(0x5594 ^ 0x5463)) ^ 0xEC2)) + 1)) ^ (0x74DEA6AD ^ ((202850694 + -816) ^ ((27384 + -24598) & -1)) ^ ((2026525675 + -24497 + -20467) ^ 0x2053)) ^ (빈죆痈讕悽欑慱楂좲.踋獮톓랼菫顶矏亅岷粛윧糑饞욾冫뉰蠙쯰뻅璭() ^ 빈죆痈讕悽欑慱楂좲.웧趤늾毑魷惥햻蔎臞宄()) ^ (빈죆痈讕悽欑慱楂좲.胖뺐륪軋瘕맚蜸빨竮飃娎搳() ^ (((-2122639831 + -148) ^ (2918 + -(-355 ^ -1)) ^ -1 ^ 0x7E84EEC2) - -(~(((0x45F85B9F ^ (43972 + -12357 + -25073)) + -(0xEB7E ^ 0x173E)) ^ (((0x15733456 ^ 0x50847260) + -858) ^ 0x51A)) + 1)) ^ (빈죆痈讕悽欑慱楂좲.隀鑱꽎룹唒쮂髁稪촯뙺黇뵮毅貲() ^ (0x1E9454F3 ^ (3713 + -(0x6C110EA4 ^ 0x6C110C5F)) ^ (0x1E94405B ^ (4432 + -(-751 ^ -1)))))), 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺((~-484774620 + 1 + -1) ^ (3540 + -350) ^ ((1097681356 + -639) ^ ((0x6A61 ^ 0x6453) + -(37516 + -12681 + -24671))) ^ (0x600D7744 ^ (8054 + -113)), 韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(빈죆痈讕悽欑慱楂좲.鶯儎逯鎈듸嶯錞歨镕极飃(), 0x6F016747 ^ (0x6F01745D ^ (40115 + -32622 + -2761 + -22)))) ^ (빈죆痈讕悽欑慱楂좲.蒁禸铱뉼済赆펟뺛婅蹚紡눍蕾ل텢飿맊癢() ^ 빈죆痈讕悽欑慱楂좲.곴号褻榲糭踀谽ず譋唇() ^ (((~-1609268815 + 1 + -1) ^ 0x1900 ^ ((799104382 + -961) ^ 0x19E1) ^ (0x704A7B04 ^ (~-3528 + 1 + -1)) ^ (((0x715BE06C ^ 0x3195) + -582) ^ 0xEE1 ^ 0x226B9ACD ^ ((~-1395658000 + 1 + -1 + -61) ^ 0x1489))) - -(~韘줎麛퍜锉薑蔴啱潕꺐뷹.菴檝閦淚柠碙庑呄鳳땚椖睨셓뮥셋僧鲚辜粙(빈죆痈讕悽欑慱楂좲.딪址淮黅窭丧僂缵췏() - -(~빈죆痈讕悽欑慱楂좲.骅릤闏武꾔晦戳种퍰幂죋蟒僾쎌뤐틪峷擵敃륮() + 1), (1159001412 + -30663 + -27786) ^ 0x1DE7 ^ -1 ^ 0x45140D14) + 1)))) + 1);
		num = -1820687566 ^ (0x39A674B9 ^ (9251 + -491));
		int num2 = 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(a, 빈죆痈讕悽欑慱楂좲.褛뚄홿볽狑蓥빝鸚퀬锭筜耷椱匵());
	}

	public int 甮먙跞뛏鐙휗竫낓鏜숏刳蠌籏컞쐁칢趍枇()
	{
		int num = 빈죆痈讕悽欑慱楂좲.쬏헯넦璋盻鼙轾침橂渟匳();
		int a = 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(((-1626954334 ^ ((147751188 + -111) ^ 0x2618)) - -(~韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(((0x65B03627 ^ (~-4759 + 1 + -1)) + -(0x19AC ^ (~-1960 + 1 + -1))) ^ ((~-1706044470 + 1 + -1 + -383) ^ 0x6FF), 0x7F553DF ^ (0x7F56846 ^ (5481 + -483))) + 1)) ^ ((((0x6CE867D9 ^ -1) + -237) ^ 0x157B ^ 0x6CE8642F ^ -1) - -(((0x5C099904 ^ ((0x4F72FA44 ^ 0x4F72F7E3) + -719)) + -(0x8B00 ^ (~-7957 + 1 + -1 + -228))) ^ 0x5C08FEAD) - -(~(0x485260CF ^ (0x48527429 ^ (6232 + -881))) + 1)), 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.즃罧죓썱曣慑訧幛倐雴蘍綊뤤() - -(~빈죆痈讕悽欑慱楂좲.덗倴钏踵和뽱뵇蟠哌庬譲졛() + 1), 韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(-110001041 ^ (46755 + -25251 + -12129) ^ -1 ^ 0x68E4AEE, (((~-890654454 + 1 + -1 + -582) ^ 0x25D3) + -(0x98C1 ^ (9727 + -(~-908 + 1 + -1)))) ^ (((890623207 + -6158) & -1) ^ 0x10F6)))) ^ ((1749883308 + -321) ^ (5630 + -((30923 + -30714) & -1)) ^ -1 ^ 0x684D0D46) ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.암텀뿀뤮辥沏俏챾殤告떉慪毖(), 韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(빈죆痈讕悽欑慱楂좲.챽滗瓢邩瑢錊팥쾐谻窠뎰暃步鱢艩瞌뜘(), 빈죆痈讕悽欑慱楂좲.瘫떻鱶撿柴솓츋巬뙆蚟衺펎()) & (-239956412 ^ ((24820 + -17041) & -1) ^ 0xE4D6FD8)), (877570333 + -391) ^ ((26219 + -19119) & -1) ^ 0x5B40EA4B ^ (0x720EB105 ^ (7908 + -380)) ^ (0x40BAF126 ^ (0x6FE79BF5 ^ (44939 + -10888 + -30291)) ^ ((794693353 + -12494 + -29534) ^ 0x1D5A)));
		num = 빈죆痈讕悽欑慱楂좲.禼쁚喳졭旹랍饼搁瘘螸쵧藌藦剮瘓业绦諛();
		int num2 = 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(a, (335416419 + -26769 + -9449) ^ 0x1415 ^ ((1460167645 + -(0x10FF482C ^ 0x10FF4AD5)) ^ (10189 + -(38394 + -28906 + -8588))) ^ (0x47032CEB ^ (40057 + -22383 + -13854 + -888)));
		int num3 = 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺((num2 ^ num) + -(~韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.瓖綋싢趿嫾뒯叔諲驁捧삒赍蟝遑轰窺緍抣럃() ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(((0x174663AE ^ (~-5661 + 1 + -1)) + -(0x7A29 ^ 0x1579)) ^ 0x1746274B, (((((1246778427 + -26062) & -1) + -901) ^ 0xA46) + -(((24182 + -9111) & -1) ^ 0xA3E)) ^ 0x4A4FAC9F) ^ (((((0x2BB8D9F ^ 0x887) + -((26004 + -950) ^ 0x256A)) ^ (0x5423EB06 ^ (34638 + -7151 + -22571 + -196)) ^ (0x4DD75C76 ^ ((~-1931812512 + 1 + -1) ^ ((15058 + -8260) & -1)) ^ 0x1A3920BD)) - -(~(0x62161E07 ^ ((1645611741 + -86) ^ ((0x3CC6E71 ^ 0x3CC792A) + -94))) + 1)) ^ (0x345A06F7 ^ 빈죆痈讕悽欑慱楂좲.鞢幢憵У滉닝뚗릱박颿())) ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(-467485021 ^ (~-3716 + 1 + -1) ^ -1 ^ ((~-467485409 + 1 + -1) ^ 0xD3F), 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(((0x27F7B269 ^ (10172 + -841)) + -(0xCB49 ^ (1206 + -(-127 ^ -1)))) ^ (0x1E363885 ^ (5405 + -688)) ^ ((~500029357 + 1 + -1 + -607) ^ 0x4E9 ^ -1 ^ ((1364811476 + -(29197 + -17950 + -10546)) ^ ((28369 + -22948) & -1))), (0x2C35D1E6 ^ (((-2055288187 ^ -1) + -668) ^ 0x43A) ^ 0x4D1F4959 ^ 빈죆痈讕悽欑慱楂좲.砦퍧鑢齿蘏蹾獢퉙悯()) - -(~(-485943627 ^ ((485988369 + -20080 + -20862) ^ 0x10A6) ^ (-403564155 ^ ((~-403566277 + 1 + -1) ^ 0x8BE))) + 1))), 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(빈죆痈讕悽欑慱楂좲.浡훟ぷ贩툏虑촞츚꽘() ^ 빈죆痈讕悽欑慱楂좲.쌛黇湪瓠捤棆싏毦翅햼燆늪乳厕褳醉쬟졶噒쏠(), (-270254628 + -367) ^ 0x1F30 ^ -1 ^ ((798857953 + -452) ^ 0x4F9) ^ (빈죆痈讕悽欑慱楂좲.柮韚圽眱弧愛譔瑞浒() ^ 0x6A70))) + 1), 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(((0x7916C8F7 ^ (5477 + -942) ^ -1 ^ (((0x3EF23412 ^ 0x3FF70B08) + -478) ^ (6959 + -992)) ^ -1) - -(0x6B45B6F1 ^ (0x6B45A8B0 ^ (~-7745 + 1 + -1))) - -(~(0x6CA8337D ^ (23061 + -3359 + -16744) ^ (0x517D29BC ^ ((0x1F2C771E ^ 0x1F2C795B) + -473)) ^ (0x3DD500F7 ^ (8615 + -(~-979 + 1 + -1)))) + 1)) ^ (0x27723541 ^ (5020 + -257) ^ (0x2772047A ^ (1827 + -127))), 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿((555691808 + -(-429 ^ -1)) ^ 0x17F2 ^ (0x25767C3C ^ ((0x4F99A9BD ^ 0x4F99A175) + -267)) ^ 0x74144F1A, (2032877294 + -26373 + -12805 + -870) ^ (15901 + -6692 + -3802) ^ ((~-2032847223 + 1 + -1) ^ (28992 + -23606 + -4196))) & (-250104800 ^ (0xEE843E3 ^ (2574 + -466))), 韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(빈죆痈讕悽欑慱楂좲.쌻妮겣煋넂뇮汲褋樹꽼呬鍚抗쓳鉚핝톘僧(), ((327192606 + -25319) & -1) ^ ((5424 + -4379) & -1) ^ (((-327171185 ^ -1) + -101) ^ 0x1403)))) ^ (韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(韘줎麛퍜锉薑蔴啱潕꺐뷹.徻舧鱄뉡뗫쫺船譐쀔둧듋淨册鼮躲冿(빈죆痈讕悽欑慱楂좲.鋖写쒹쌛앿鯳叝搞핓儭咛硂켫(), (~-953289941 + 1 + -1) ^ 0x16B1 ^ -1 ^ 0x38D219C5 ^ -1), (빈죆痈讕悽欑慱楂좲.憐蘮駃祳맭믾썩齳耱() ^ -1) - -(0x966CE76 ^ (0x966C85D ^ (2376 + -(34374 + -12906 + -20670)))) - -(~((((~-2100328668 + 1 + -1 + -551) ^ 0x9F3) + -(0xF66 ^ 0x1365)) ^ (0x7D306979 ^ (3603 + -((8455 + -7472) & -1)))) + 1)) ^ 韘줎麛퍜锉薑蔴啱潕꺐뷹.忙븮갔퐠뺀糪髟嚪棃튉悤艶鲻랄궺鮍兺(-360140084 ^ (7986 + -66) ^ -1 ^ (0x4094113C ^ ((22180 + -16112) & -1)), 0x5651598A ^ ((1448216806 + -11510 + -30551) ^ ((0x5D2AFCC6 ^ 0x5D2AD9B0) + -373)))));
		num = 0x16AD23EC ^ (((29270 + -21841) & -1) + -905) ^ -1 ^ 0x824E100;
		num2 = num3 ^ 빈죆痈讕悽欑慱楂좲.慕俟갷舴槭뱺慮朧蝝쪵눟뱳혦渷뻇과鷫躖();
		return num2 ^ num;
	}

	internal string 鴈뀡贼핦斀숸惮충簍纨룸ト뻄眮酄梌脵鱃颙()
	{
		string text = 鈋춹鑀憆燧濩雂支簲拍쵁灎.푙춣뇒澕錅캎炐檽獚똾憌("P7HoClUVmXWlsPJoRIOiJUhszeCLwkDDCxQ21W+UkVIJqtnlSRt8VCHa/Ty/5IKBBXuWvzaFini3uDG2n5D0XxkoCiuWRwjeRBhN/k9NWiK+baDHyjgSQDoCG29G4ReMMA==");
		return 鈋춹鑀憆燧濩雂支簲拍쵁灎.푙춣뇒澕錅캎炐檽獚똾憌("AE5hJYLLQNrNSx7HM7YaiNh5WCup2H+WN8bGqMIcUnpztuq66KYClpDtB2UnvWbUWtJzQwf8rheNvcHw+kblTN4tevd8oMvN/YgQya2i8kLHJdNSQK6vCY4Oj/7mXDWCbw==");
	}

	public 龸鴿뛥蠄倉啦쒋鳑吏僩怨臍쯦簽羧()
	{
		龸鴿뛥蠄倉啦쒋鳑吏僩怨臍쯦簽羧.潼쫼폋慉叹뫷칃濘撓痥餷楎齐쪪渺 = 2100402928;
		龸鴿뛥蠄倉啦쒋鳑吏僩怨臍쯦簽羧.殂춵셚嶐檆禲绳З菌獰 = 1596270928;
		龸鴿뛥蠄倉啦쒋鳑吏僩怨臍쯦簽羧.횥楛쪚谥錉蒮驵骜悭뤌ب奅绅歳爊炠躥逋 = -3115475537137345301L;
	}

	private static int 柀兟뫤礟夆幫姶휇멌曥榆擌鄈튤晗庋뾖뱗畏()
	{
		int num = ((-1694038491 ^ (~-4494 + 1 + -1)) + -(((11441 + -529) & -1) ^ 0x602)) ^ (0x53198CE ^ (3178 + -505));
		num = (num ^ 0x7B40F0F5) << (-398803089 ^ (7386 + -935) ^ -1 ^ 0x17C559BA);
		num = (num ^ (((0x7F48413 ^ ((37549 + -29601) & -1)) + -((~-10858 + 1 + -1) ^ 0x19C6)) ^ (0x5E81D589 ^ (10026 + -284)))) << ((147508157 + -((29584 + -29420) & -1)) ^ 0x1FC5 ^ 0x8CAD4DB);
		num = (num ^ 0x3C5EFFD0) << ((1111368683 + -206) ^ (2856 + -(0x7630313C ^ 0x7630304B)) ^ 0x423E2AB5);
		return 0x1C634B1 ^ (7389 + -195) ^ 0x1C628AB;
	}

	private static int 耜噟횁犲뺲섮欓巏슯덃莒狦첗祦鶅颚쳡愍쥑()
	{
		int num = -979226982 ^ 0x5B955723;
		num = (num ^ (((-1563993297 + -32581) & -1) ^ (40167 + -25768 + -6030) ^ -1 ^ 0x35BBB301)) << ((1012649163 + -27650 + -17228) ^ 0x228E ^ 0x3B184C62 ^ ((121859170 + -543) ^ 0x19C7));
		num = (num ^ (((1687447451 + -8331) & -1) ^ 0x18AC ^ (((-1057889337 ^ -1) + -90) ^ 0x20D6))) << ((-1670078561 + -795) ^ (37083 + -27830 + -3635) ^ -1 ^ ((1670083018 + -228) ^ 0x67C));
		num = (num ^ (-587634718 ^ (5108 + -798) ^ -1 ^ (0x1D25EE3C ^ (4731 + -75)))) << ((-1643060006 + -((5821 + -5277) & -1)) ^ 0x803 ^ -1 ^ ((~-1643057257 + 1 + -1) ^ ((-2058 ^ -1) + -718)));
		num = (num ^ (((0x1388E244 ^ 0xA77) + -(((59055 + -1162) & -1) ^ 0x5D4)) ^ (0x1D9D46C4 ^ ((-8392 ^ -1) + -((4208 + -3876) & -1))))) << (((-554663609 ^ 0x56952EAF) + -288) ^ (10496 + -((2882 + -2319) & -1)) ^ -1 ^ 0x779A77E4);
		num = (num ^ (0x3A124133 ^ ((0x4CF89EE1 ^ 0x4CF887BE) + -986) ^ 0x33E17677 ^ ((1011023161 + -583) ^ 0x17F4))) << (0xC8308C ^ 0xC83085);
		num = (num ^ 0x64DB7768) << (0x6384BE97 ^ (0x638498CB ^ (9919 + -100)));
		return (~2092738912 + 1 + -1) ^ 0x15B4 ^ -1 ^ 0x7CBCBCD4;
	}

	private static int 딳憊恎战戓铲衂쏄()
	{
		int num = 0x3BEC5F65 ^ 0x3BEC5F79;
		do
		{
			num -= -(((200415632 + -536) & -1) ^ 0x804 ^ 0xBF21F7F);
		}
		while (num < (((0x2EE34663 ^ 0xCFC) + -((36665 + -281) ^ 0x1E4D)) ^ (0x2EE2B48A ^ (4067 + -(-98 ^ -1)))));
		return -1530428760 ^ (3169 + -450) ^ -1 ^ ((1530427914 + -(0xB91AA00 ^ 0xB91AB36)) ^ (36630 + -10236 + -22526));
	}

	private static bool 義肙鲂珥뀭虯幑劂裹()
	{
		int num = -1640531527;
		num = (num ^ 0x5F06E402) << 12;
		num = (num ^ 0x575A2271) << 17;
		num = (num ^ 0x6479F561) << 6;
		num = (num ^ 0x4A3A6CE7) << 23;
		return false;
	}
}
