using System;

internal sealed class 쩍飄갚픆뷓딾潽뻮 : Attribute
{
	private static int 륓혝谼酡葉첹緫챶愩뫐뻕柚鴖恩鞎滱퐒睭챷()
	{
		int num = 0x19D09F12 ^ (0x19D097C7 ^ ((18520 + -16252) & -1));
		do
		{
			num -= -(0x5923E42E ^ 0x5923E42C);
		}
		while (num < (((0x7CF6D106 ^ 0x245B) + -(0xAF3D ^ (34124 + -25902 + -5761))) ^ (0x7CF65A82 ^ (~-5281 + 1 + -1))));
		return -482923834 ^ ((0x3264 ^ 0x10E8) + -744) ^ -1 ^ ((482925771 + -291) ^ (16899 + -4397 + -7364 + -733));
	}

	private static void 鱟箈뗆血띋掂菏먹찚彞()
	{
		int num = -1727188301 ^ (0x73A5296 ^ (6847 + -291));
		num = (num ^ (0x13E31A5A ^ ((1036816263 + -424) ^ 0xCB1))) << (0x11F9C627 ^ (0x11F9C39A ^ (1715 + -(-276 ^ -1))));
		num = (num ^ (0x28B90591 ^ ((1971526853 + -(~-633 + 1 + -1)) ^ (6346 + -(52317 + -23852 + -28402))))) << ((~571615603 + 1 + -1) ^ (4844 + -737) ^ -1 ^ 0x2212397A);
		num = (num ^ (((0x3F60B4A1 ^ 0x25AC) + -(0x21B5 ^ 0x1AE9)) ^ 0x2B7F4154)) << (0x20CBC9E1 ^ ((0x30A92D8A ^ 0x30A90570) + -890) ^ 0x20CBEC7B);
		num = (num ^ (0x612E39CE ^ ((29945 + -20127) & -1) ^ ((((623083369 + -12923) & -1) + -683) ^ 0x24F7))) << ((-1452175847 + -(~-826 + 1 + -1)) ^ 0x217E ^ -1 ^ 0x568E5467);
		num = (num ^ ((~-57143372 + 1 + -1) ^ 0xB99 ^ 0x76F0F0D4 ^ 0x76063E24)) << (((-1979582304 + -5608) & -1) ^ 0x16E0 ^ -1 ^ (0x75FE13C1 ^ ((0x658E0DE6 ^ 0x658E1504) + -(0x122E ^ 0x1254))));
	}

	private static void 掮뇵釠虀娻걛鵅标埔뼬壦螵()
	{
		int num = 10;
		do
		{
			num += 3;
		}
		while (num < 532);
	}

	private static void 휆쁛淾蕋啓댆셤纗窪飧燆纑浇()
	{
		int num = 28;
		do
		{
			num += 3;
		}
		while (num < 629);
	}

	private static bool 뷤涸覱魖ل亻臚鯭()
	{
		int num = 25;
		do
		{
			num += 3;
		}
		while (num < 316);
		return false;
	}
}
